Autodesk.Revit.DB.Analysis.AllowLargeGeometry
An enumerated type containing settings information related to handling of large geometries.
Since:
2020
Since:
2020

Autodesk.Revit.DB.Analysis.AllowLargeGeometry.Prompt
Prompt in the UI. If no UI is present, default will be DisAllow.

Autodesk.Revit.DB.Analysis.AllowLargeGeometry.Allow
Allow export/path of travel creation on large geometries.

Autodesk.Revit.DB.Analysis.AllowLargeGeometry.DisAllow
Cancel the export/path of travel creation, failing with the apporiate status.